ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_soc_ctrl_regs.xml
<module id="HSM_SOC_CTRL" HW_revision="" description="HSM SOC CTRL Registers">
	<register id="PID" width="32" page="0" offset="0" internal="0" description="PID register">
		<bitfield id="PID_MINOR" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="PID_CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="PID_MAJOR" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="PID_MISC" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="PID_MSB16" description="" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="HW_REG0" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="HW_REG0_HWREG0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HW_REG1" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="HW_REG1_HWREG1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HW_REG2" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="HW_REG2_HWREG2" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HW_REG3" width="32" page="0" offset="16" internal="0" description="">
		<bitfield id="HW_REG3_HWREG3" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SECAP_TX_DATA" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="SECAP_TX_DATA_JTAGTXDATA" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SECAP_TX_CONTROL" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="SECAP_TX_CONTROL_TXDATA_AVAIL" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SECAP_TX_CONTROL_JTAGTXCONTROL" description="" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="SECAP_RX_DATA" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="SECAP_RX_DATA_JTAGRXDATA" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SECAP_RX_CONTROL" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="SECAP_RX_CONTROL_RXDATA_AVAIL" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SECAP_RX_CONTROL_JTAGRXCONTROL" description="" begin="31" end="1" width="31" rwaccess="RW"/>
	</register>
	<register id="HSM_MBOX_MEMINIT_START" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="HSM_MBOX_MEMINIT_START_HSM_MBOX_MEMINIT_START" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_MBOX_MEMINIT_STATUS" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="HSM_MBOX_MEMINIT_STATUS_HSM_MBOX_MEMINIT_STATUS" description="" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="HSM_MBOX_MEMINIT_DONE" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="HSM_MBOX_MEMINIT_DONE_HSM_MBOX_MEMINIT_DONE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_MBOX_WRITE_DONE" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_1" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_2" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_3" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_4" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_5" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_6" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_WRITE_DONE_PROC_7" description="" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_MBOX_READ_REQ" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="HSM_MBOX_READ_REQ_PROC_0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_1" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_2" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_3" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_4" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_5" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_6" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_REQ_PROC_7" description="" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_MBOX_READ_DONE_ACK" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_1" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_2" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_3" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_4" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_5" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_6" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_ACK_PROC_7" description="" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_MBOX_READ_DONE" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="HSM_MBOX_READ_DONE_PROC_0" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_1" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_2" description="" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_3" description="" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_4" description="" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_5" description="" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_6" description="" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="HSM_MBOX_READ_DONE_PROC_7" description="" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_CAPEVNT_SEL0" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="HSM_CAPEVNT_SEL0_SRC0_RTI" description="" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="HSM_CAPEVNT_SEL0_SRC1_RTI" description="" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="HSM_CAPEVNT_SEL0_SRC0_WDT" description="" begin="22" end="16" width="7" rwaccess="RW"/>
		<bitfield id="HSM_CAPEVNT_SEL0_SRC1_WDT" description="" begin="30" end="24" width="7" rwaccess="RW"/>
	</register>
	<register id="HSM_DMA_REQ" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="HSM_DMA_REQ_SELECT" description="" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
