ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_soc_ctrl_regs.xml
	<register id="HSM_IRQ_REQ" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="HSM_IRQ_REQ_SELECT" description="" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_REQ" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="HSM_ESM_REQ_SELECT" description="" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP2_MASK0" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE0" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE1" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE2" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE3" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE4" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE5" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE6" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK0_LINE7" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP2_MASK1" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE8" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE9" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE10" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE11" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE12" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE13" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE14" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK1_LINE15" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP2_MASK2" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE16" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE17" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE18" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE19" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE20" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE21" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE22" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK2_LINE23" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP2_MASK3" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE24" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE25" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE26" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE27" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE28" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE29" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE30" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP2_MASK3_LINE31" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP3_MASK0" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE0" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE1" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE2" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE3" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE4" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE5" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE6" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK0_LINE7" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP3_MASK1" width="32" page="0" offset="116" internal="0" description="">
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE8" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE9" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE10" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE11" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE12" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE13" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE14" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK1_LINE15" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP3_MASK2" width="32" page="0" offset="120" internal="0" description="">
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE16" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE17" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE18" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE19" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE20" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE21" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE22" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK2_LINE23" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_ESM_GRP3_MASK3" width="32" page="0" offset="124" internal="0" description="">
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE24" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE25" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE26" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE27" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE28" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE29" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE30" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_ESM_GRP3_MASK3_LINE31" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
