ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_soc_ctrl_regs.xml
	<register id="HSM_TO_SOC_INT_MASK" width="32" page="0" offset="208" internal="0" description="">
		<bitfield id="HSM_TO_SOC_INT_MASK_SHA_S" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_SHA_P" description="" begin="6" end="4" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_TRNG" description="" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_PKA" description="" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_AES_S" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_AES_P" description="" begin="22" end="20" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_ESM_HI" description="" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_ESM_LO" description="" begin="30" end="28" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_WDT_RST_CONFIG" width="32" page="0" offset="212" internal="0" description="">
		<bitfield id="HSM_WDT_RST_CONFIG_ENABLE" description="" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_CM4_AHB_ERRAGG_MASK" width="32" page="0" offset="240" internal="0" description="">
		<bitfield id="HSM_CM4_AHB_ERRAGG_MASK_IBUS_WRITE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_CM4_AHB_ERRAGG_MASK_DBUS_WRITE" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HSM_CM4_AHB_ERRAGG_MASK_SBUS_WRITE" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_CM4_AHB_ERRAGG_STATUS" width="32" page="0" offset="244" internal="0" description="">
		<bitfield id="HSM_CM4_AHB_ERRAGG_STATUS_IBUS_WRITE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_CM4_AHB_ERRAGG_STATUS_DBUS_WRITE" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HSM_CM4_AHB_ERRAGG_STATUS_SBUS_WRITE" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_CM4_AHB_ERRAGG_STATUS_RAW" width="32" page="0" offset="248" internal="0" description="">
		<bitfield id="HSM_CM4_AHB_ERRAGG_STATUS_RAW_IBUS_WRITE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HSM_CM4_AHB_ERRAGG_STATUS_RAW_DBUS_WRITE" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HSM_CM4_AHB_ERRAGG_STATUS_RAW_SBUS_WRITE" description="" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_TO_SOC_INT_MASK2" width="32" page="0" offset="252" internal="0" description="">
		<bitfield id="HSM_TO_SOC_INT_MASK_SM3" description="" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_INT_MASK_SM4" description="" begin="6" end="4" width="3" rwaccess="RW"/>
	</register>
	<register id="HSM_APPCPU_RST_CAUSE" width="32" page="0" offset="256" internal="0" description="Host CPU Reset status register. Reset on PORESETn only">
		<bitfield id="HSM_APPCPU_RST_CAUSE_STATUS" description="" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="HSM_APPCPU_RST_CAUSE_CLR" width="32" page="0" offset="260" internal="0" description="">
		<bitfield id="HSM_APPCPU_RST_CAUSE_CLR_CLEAR" description="" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="HSM_RTC_CFG_CTRL" width="32" page="0" offset="2092" internal="0" description="">
		<bitfield id="HSM_RTC_CFG_CTRL_COUNTER_READ_ENABLE" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="HSM_RTC_CFG_STATUS" width="32" page="0" offset="2096" internal="0" description="">
		<bitfield id="HSM_RTC_CFG_STATUS_READ_VALID" description="" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="HSM_RTC_MSB_COUNTER" width="32" page="0" offset="2100" internal="0" description="">
		<bitfield id="HSM_RTC_MSB_COUNTER_VALUE" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_RTC_LSB_COUNTER" width="32" page="0" offset="2104" internal="0" description="">
		<bitfield id="HSM_RTC_LSB_COUNTER_VALUE" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_TO_SOC_DMA_MASK" width="32" page="0" offset="2108" internal="0" description="">
		<bitfield id="HSM_TO_SOC_DMA_MASK_AES" description="" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_DMA_MASK_SHA" description="" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_DMA_MASK_SM3" description="" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="HSM_TO_SOC_DMA_MASK_SM4" description="" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="SRAM_USURP_CONTROL" width="32" page="0" offset="2688" internal="0" description="">
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B2" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B5" description="" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B6" description="" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="SRAM_USURP_CONTROL_SRAM_B7" description="" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="FLC1_BANK_USURP_CONTROL" width="32" page="0" offset="2696" internal="0" description="">
		<bitfield id="FLC1_BANK_USURP_CONTROL_FLASH_B3" description="" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="FLC1_BANK_USURP_CONTROL_FLASH_B4" description="" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="POST_USURP_CONTROL" width="32" page="0" offset="2704" internal="0" description="">
		<bitfield id="POST_USURP_CONTROL_MPOST" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="POST_USURP_CONTROL_LPOST" description="" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="SOC_USURP_CONTROL1" width="32" page="0" offset="2708" internal="0" description="">
		<bitfield id="SOC_USURP_CONTROL1_CTRL1" description="" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="HSM_TX_REG0" width="32" page="0" offset="2752" internal="0" description="HSM to SOC Transmit register 0">
		<bitfield id="HSM_TX_REG0_TX_REG" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
