ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_soc_ctrl_regs.xml
	<register id="HSM_TX_REG1" width="32" page="0" offset="2756" internal="0" description="HSM to SOC Transmit register 1">
		<bitfield id="HSM_TX_REG1_TX_REG" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HSM_RX_REG0" width="32" page="0" offset="2760" internal="0" description="SOC to HSM Transmit register 0">
		<bitfield id="HSM_RX_REG0_RX_REG" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_RX_REG1" width="32" page="0" offset="2764" internal="0" description="SOC to HSM Transmit register 1">
		<bitfield id="HSM_RX_REG1_RX_REG" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SOCACC_ERROR_TYPE" width="32" page="0" offset="2768" internal="0" description="Error status of HSM to SOC Access">
		<bitfield id="HSM_SOCACC_ERROR_TYPE_STATUS" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="HSM_SOCACC_ERROR_ADDR" width="32" page="0" offset="2772" internal="0" description="Error Address of HSM to SOC Access">
		<bitfield id="HSM_SOCACC_ERROR_ADDR_STATUS" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SOCACC_ERROR_CLR" width="32" page="0" offset="2776" internal="0" description="">
		<bitfield id="HSM_SOCACC_ERROR_CLR_CLEAR" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="LOCK0_KICK0" width="32" page="0" offset="4104" internal="0" description="Lock register for HSM_CTRL and HSM_SOC_CTRL registers.">
		<bitfield id="LOCK0_KICK0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="LOCK0_KICK1" width="32" page="0" offset="4108" internal="0" description="Unlock register for HSM_CTRL and HSM_SOC_CTRL registers.">
		<bitfield id="LOCK0_KICK1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
